---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightKey.#ctor(System.Int32)
source: html/11202f9b-a136-ec5f-6e68-2d7a8abd60f1.htm
---
# Autodesk.Revit.DB.ExportLineweightKey.#ctor Method

Constructs a new default ExportLineweightKey using the original line weight as input.

## Syntax (C#)
```csharp
public ExportLineweightKey(
	int originalLineweight
)
```

## Parameters
- **originalLineweight** (`System.Int32`) - The original line weight.